ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U5xx/stm32u5g9xx.h
/************* Bit definition for HSPI_WPIR register  *************************/
#define HSPI_WPIR_INSTRUCTION_Pos        XSPI_WPIR_INSTRUCTION_Pos
#define HSPI_WPIR_INSTRUCTION_Msk        XSPI_WPIR_INSTRUCTION_Msk                        /*!< 0xFFFFFFFF */
#define HSPI_WPIR_INSTRUCTION            XSPI_WPIR_INSTRUCTION                            /*!< Instruction */

/************* Bit definition for HSPI_WPABR register  *************************/
#define HSPI_WPABR_ALTERNATE_Pos         XSPI_WPABR_ALTERNATE_Pos
#define HSPI_WPABR_ALTERNATE_Msk         XSPI_WPABR_ALTERNATE_Msk                         /*!< 0xFFFFFFFF */
#define HSPI_WPABR_ALTERNATE             XSPI_WPABR_ALTERNATE                             /*!< Alternate Bytes */

/************* Bit definition for HSPI_WCCR register  **************************/
#define HSPI_WCCR_IMODE_Pos              XSPI_WCCR_IMODE_Pos
#define HSPI_WCCR_IMODE_Msk              XSPI_WCCR_IMODE_Msk                              /*!< 0x00000007 */
#define HSPI_WCCR_IMODE                  XSPI_WCCR_IMODE                                  /*!< Instruction Mode */
#define HSPI_WCCR_IMODE_0                XSPI_WCCR_IMODE_0                                /*!< 0x00000001 */
#define HSPI_WCCR_IMODE_1                XSPI_WCCR_IMODE_1                                /*!< 0x00000002 */
#define HSPI_WCCR_IMODE_2                XSPI_WCCR_IMODE_2                                /*!< 0x00000004 */
#define HSPI_WCCR_IDTR_Pos               XSPI_WCCR_IDTR_Pos
#define HSPI_WCCR_IDTR_Msk               XSPI_WCCR_IDTR_Msk                               /*!< 0x00000008 */
#define HSPI_WCCR_IDTR                   XSPI_WCCR_IDTR                                   /*!< Instruction Double Transfer Rate */
#define HSPI_WCCR_ISIZE_Pos              XSPI_WCCR_ISIZE_Pos
#define HSPI_WCCR_ISIZE_Msk              XSPI_WCCR_ISIZE_Msk                              /*!< 0x00000030 */
#define HSPI_WCCR_ISIZE                  XSPI_WCCR_ISIZE                                  /*!< Instruction Size */
#define HSPI_WCCR_ISIZE_0                XSPI_WCCR_ISIZE_0                                /*!< 0x00000010 */
#define HSPI_WCCR_ISIZE_1                XSPI_WCCR_ISIZE_1                                /*!< 0x00000020 */
#define HSPI_WCCR_ADMODE_Pos             XSPI_WCCR_ADMODE_Pos
#define HSPI_WCCR_ADMODE_Msk             XSPI_WCCR_ADMODE_Msk                             /*!< 0x00000700 */
#define HSPI_WCCR_ADMODE                 XSPI_WCCR_ADMODE                                 /*!< Address Mode */
#define HSPI_WCCR_ADMODE_0               XSPI_WCCR_ADMODE_0                               /*!< 0x00000100 */
#define HSPI_WCCR_ADMODE_1               XSPI_WCCR_ADMODE_1                               /*!< 0x00000200 */
#define HSPI_WCCR_ADMODE_2               XSPI_WCCR_ADMODE_2                               /*!< 0x00000400 */
#define HSPI_WCCR_ADDTR_Pos              XSPI_WCCR_ADDTR_Pos
#define HSPI_WCCR_ADDTR_Msk              XSPI_WCCR_ADDTR_Msk                              /*!< 0x00000800 */
#define HSPI_WCCR_ADDTR                  XSPI_WCCR_ADDTR                                  /*!< Address Double Transfer Rate */
#define HSPI_WCCR_ADSIZE_Pos             XSPI_WCCR_ADSIZE_Pos
#define HSPI_WCCR_ADSIZE_Msk             XSPI_WCCR_ADSIZE_Msk                             /*!< 0x00003000 */
#define HSPI_WCCR_ADSIZE                 XSPI_WCCR_ADSIZE                                 /*!< Address Size */
#define HSPI_WCCR_ADSIZE_0               XSPI_WCCR_ADSIZE_0                               /*!< 0x00001000 */
#define HSPI_WCCR_ADSIZE_1               XSPI_WCCR_ADSIZE_1                               /*!< 0x00002000 */
#define HSPI_WCCR_ABMODE_Pos             XSPI_WCCR_ABMODE_Pos
#define HSPI_WCCR_ABMODE_Msk             XSPI_WCCR_ABMODE_Msk                             /*!< 0x00070000 */
#define HSPI_WCCR_ABMODE                 XSPI_WCCR_ABMODE                                 /*!< Alternate Bytes Mode */
#define HSPI_WCCR_ABMODE_0               XSPI_WCCR_ABMODE_0                               /*!< 0x00010000 */
#define HSPI_WCCR_ABMODE_1               XSPI_WCCR_ABMODE_1                               /*!< 0x00020000 */
#define HSPI_WCCR_ABMODE_2               XSPI_WCCR_ABMODE_2                               /*!< 0x00040000 */
#define HSPI_WCCR_ABDTR_Pos              XSPI_WCCR_ABDTR_Pos
#define HSPI_WCCR_ABDTR_Msk              XSPI_WCCR_ABDTR_Msk                              /*!< 0x00080000 */
#define HSPI_WCCR_ABDTR                  XSPI_WCCR_ABDTR                                  /*!< Alternate Bytes Double Transfer Rate */
#define HSPI_WCCR_ABSIZE_Pos             XSPI_WCCR_ABSIZE_Pos
#define HSPI_WCCR_ABSIZE_Msk             XSPI_WCCR_ABSIZE_Msk                             /*!< 0x00300000 */
#define HSPI_WCCR_ABSIZE                 XSPI_WCCR_ABSIZE                                 /*!< Alternate Bytes Size */
#define HSPI_WCCR_ABSIZE_0               XSPI_WCCR_ABSIZE_0                               /*!< 0x00100000 */
#define HSPI_WCCR_ABSIZE_1               XSPI_WCCR_ABSIZE_1                               /*!< 0x00200000 */
#define HSPI_WCCR_DMODE_Pos              XSPI_WCCR_DMODE_Pos
#define HSPI_WCCR_DMODE_Msk              XSPI_WCCR_DMODE_Msk                              /*!< 0x07000000 */
#define HSPI_WCCR_DMODE                  XSPI_WCCR_DMODE                                  /*!< Data Mode */
#define HSPI_WCCR_DMODE_0                XSPI_WCCR_DMODE_0                                /*!< 0x01000000 */
#define HSPI_WCCR_DMODE_1                XSPI_WCCR_DMODE_1                                /*!< 0x02000000 */
#define HSPI_WCCR_DMODE_2                XSPI_WCCR_DMODE_2                                /*!< 0x04000000 */
#define HSPI_WCCR_DDTR_Pos               XSPI_WCCR_DDTR_Pos
#define HSPI_WCCR_DDTR_Msk               XSPI_WCCR_DDTR_Msk                               /*!< 0x08000000 */
#define HSPI_WCCR_DDTR                   XSPI_WCCR_DDTR                                   /*!< Data Double Transfer Rate */
#define HSPI_WCCR_DQSE_Pos               XSPI_WCCR_DQSE_Pos
#define HSPI_WCCR_DQSE_Msk               XSPI_WCCR_DQSE_Msk                               /*!< 0x20000000 */
#define HSPI_WCCR_DQSE                   XSPI_WCCR_DQSE                                   /*!< DQS Enable */

/************* Bit definition for HSPI_WTCR register  *************************/
#define HSPI_WTCR_DCYC_Pos               XSPI_WTCR_DCYC_Pos
#define HSPI_WTCR_DCYC_Msk               XSPI_WTCR_DCYC_Msk                               /*!< 0x0000001F */
#define HSPI_WTCR_DCYC                   XSPI_WTCR_DCYC                                   /*!< Number of Dummy Cycles */

/************* Bit definition for HSPI_WIR register  **************************/
#define HSPI_WIR_INSTRUCTION_Pos         XSPI_WIR_INSTRUCTION_Pos
#define HSPI_WIR_INSTRUCTION_Msk         XSPI_WIR_INSTRUCTION_Msk                         /*!< 0xFFFFFFFF */
#define HSPI_WIR_INSTRUCTION             XSPI_WIR_INSTRUCTION                             /*!< Instruction */

/************* Bit definition for HSPI_WABR register  *************************/
#define HSPI_WABR_ALTERNATE_Pos          XSPI_WABR_ALTERNATE_Pos
#define HSPI_WABR_ALTERNATE_Msk          XSPI_WABR_ALTERNATE_Msk                          /*!< 0xFFFFFFFF */
#define HSPI_WABR_ALTERNATE              XSPI_WABR_ALTERNATE                              /*!< Alternate Bytes */

/************* Bit definition for HSPI_HLCR register  *************************/
#define HSPI_HLCR_LM_Pos                 XSPI_HLCR_LM_Pos
#define HSPI_HLCR_LM_Msk                 XSPI_HLCR_LM_Msk                                 /*!< 0x00000001 */
#define HSPI_HLCR_LM                     XSPI_HLCR_LM                                     /*!< Latency Mode */
#define HSPI_HLCR_WZL_Pos                XSPI_HLCR_WZL_Pos
#define HSPI_HLCR_WZL_Msk                XSPI_HLCR_WZL_Msk                                /*!< 0x00000002 */
#define HSPI_HLCR_WZL                    XSPI_HLCR_WZL                                    /*!< Write Zero Latency */
#define HSPI_HLCR_TACC_Pos               XSPI_HLCR_TACC_Pos
#define HSPI_HLCR_TACC_Msk               XSPI_HLCR_TACC_Msk                               /*!< 0x0000FF00 */
#define HSPI_HLCR_TACC                   XSPI_HLCR_TACC                                   /*!< Access Time */
#define HSPI_HLCR_TRWR_Pos               XSPI_HLCR_TRWR_Pos
#define HSPI_HLCR_TRWR_Msk               XSPI_HLCR_TRWR_Msk                               /*!< 0x00FF0000 */
#define HSPI_HLCR_TRWR                   XSPI_HLCR_TRWR                                   /*!< Read Write Recovery Time */

/************* Bit definition for HSPI_CALFCR register  ***********************/
#define HSPI_CALFCR_FINE_Pos             XSPI_HSPI_CALFCR_FINE_Pos
#define HSPI_CALFCR_FINE_Msk             XSPI_HSPI_CALFCR_FINE_Msk                        /*!< 0x0000007F */
#define HSPI_CALFCR_FINE                 XSPI_HSPI_CALFCR_FINE                            /*!< Fine Calibration */
#define HSPI_CALFCR_COARSE_Pos           XSPI_HSPI_CALFCR_COARSE_Pos
#define HSPI_CALFCR_COARSE_Msk           XSPI_HSPI_CALFCR_COARSE_Msk                      /*!< 0x001F0000 */
#define HSPI_CALFCR_COARSE               XSPI_HSPI_CALFCR_COARSE                          /*!< Coarse Calibration */
#define HSPI_CALFCR_CALMAX_Pos           XSPI_HSPI_CALFCR_CALMAX_Pos
#define HSPI_CALFCR_CALMAX_Msk           XSPI_HSPI_CALFCR_CALMAX_Msk                      /*!< 0x80000000 */
#define HSPI_CALFCR_CALMAX               XSPI_HSPI_CALFCR_CALMAX                          /*!< Max Value */

/************* Bit definition for HSPI_CALMR register  ***********************/
#define HSPI_CALMR_FINE_Pos              XSPI_HSPI_CALMR_FINE_Pos
#define HSPI_CALMR_FINE_Msk              XSPI_HSPI_CALMR_FINE_Msk                         /*!< 0x0000007F */
#define HSPI_CALMR_FINE                  XSPI_HSPI_CALMR_FINE                             /*!< Fine Calibration */
#define HSPI_CALMR_COARSE_Pos            XSPI_HSPI_CALMR_COARSE_Pos
#define HSPI_CALMR_COARSE_Msk            XSPI_HSPI_CALMR_COARSE_Msk                       /*!< 0x001F0000 */
#define HSPI_CALMR_COARSE                XSPI_HSPI_CALMR_COARSE                           /*!< Coarse Calibration */

/************* Bit definition for HSPI_CALSOR register  ***********************/
#define HSPI_CALSOR_FINE_Pos             XSPI_HSPI_CALSOR_FINE_Pos
#define HSPI_CALSOR_FINE_Msk             XSPI_HSPI_CALSOR_FINE_Msk                        /*!< 0x0000007F */
#define HSPI_CALSOR_FINE                 XSPI_HSPI_CALSOR_FINE                            /*!< Fine Calibration */
#define HSPI_CALSOR_COARSE_Pos           XSPI_HSPI_CALSOR_COARSE_Pos
#define HSPI_CALSOR_COARSE_Msk           XSPI_HSPI_CALSOR_COARSE_Msk                      /*!< 0x001F0000 */
#define HSPI_CALSOR_COARSE               XSPI_HSPI_CALSOR_COARSE                          /*!< Coarse Calibration */

/************* Bit definition for HSPI_CALSIR register  ***********************/
#define HSPI_CALSIR_FINE_Pos             XSPI_HSPI_CALSIR_FINE_Pos
#define HSPI_CALSIR_FINE_Msk             XSPI_HSPI_CALSIR_FINE_Msk                        /*!< 0x0000007F */
#define HSPI_CALSIR_FINE                 XSPI_HSPI_CALSIR_FINE                            /*!< Fine Calibration */
#define HSPI_CALSIR_COARSE_Pos           XSPI_HSPI_CALSIR_COARSE_Pos
#define HSPI_CALSIR_COARSE_Msk           XSPI_HSPI_CALSIR_COARSE_Msk                      /*!< 0x001F0000 */
#define HSPI_CALSIR_COARSE               XSPI_HSPI_CALSIR_COARSE                          /*!< Coarse Calibration */

/******************************************************************************/
/*                                                                            */
/*                                  XSPIM (OCTOSPIM)                                  */
/*                                                                            */
/******************************************************************************/
/***************  Bit definition for XSPIM_CR register  ********************/
#define XSPIM_CR_MUXEN_Pos               (0U)
#define XSPIM_CR_MUXEN_Msk               (0x1UL << XSPIM_CR_MUXEN_Pos)                    /*!< 0x00000001 */
#define XSPIM_CR_MUXEN                   XSPIM_CR_MUXEN_Msk                               /*!< Multiplexed Mode Enable */
#define XSPIM_CR_REQ2ACK_TIME_Pos        (16U)
#define XSPIM_CR_REQ2ACK_TIME_Msk        (0xFFUL << XSPIM_CR_REQ2ACK_TIME_Pos)            /*!< 0x00FF0000 */
#define XSPIM_CR_REQ2ACK_TIME            XSPIM_CR_REQ2ACK_TIME_Msk                        /*!< REQ to ACK Time */

/***************  Bit definition for XSPIM_PCR register  *****************/
#define XSPIM_PCR_CLKEN_Pos              (0U)
#define XSPIM_PCR_CLKEN_Msk              (0x1UL << XSPIM_PCR_CLKEN_Pos)                   /*!< 0x00000001 */
#define XSPIM_PCR_CLKEN                  XSPIM_PCR_CLKEN_Msk                              /*!< CLK/CLKn Enable for Port n */
#define XSPIM_PCR_CLKSRC_Pos             (1U)
#define XSPIM_PCR_CLKSRC_Msk             (0x1UL << XSPIM_PCR_CLKSRC_Pos)                  /*!< 0x00000002 */
#define XSPIM_PCR_CLKSRC                 XSPIM_PCR_CLKSRC_Msk                             /*!< CLK/CLKn Source for Port n*/
#define XSPIM_PCR_DQSEN_Pos              (4U)
#define XSPIM_PCR_DQSEN_Msk              (0x1UL << XSPIM_PCR_DQSEN_Pos)                   /*!< 0x00000010 */
#define XSPIM_PCR_DQSEN                  XSPIM_PCR_DQSEN_Msk                              /*!< DQS Enable for Port n */
#define XSPIM_PCR_DQSSRC_Pos             (5U)
#define XSPIM_PCR_DQSSRC_Msk             (0x1UL << XSPIM_PCR_DQSSRC_Pos)                  /*!< 0x00000020 */
#define XSPIM_PCR_DQSSRC                 XSPIM_PCR_DQSSRC_Msk                             /*!< DQS Source for Port n */
#define XSPIM_PCR_NCSEN_Pos              (8U)
#define XSPIM_PCR_NCSEN_Msk              (0x1UL << XSPIM_PCR_NCSEN_Pos)                   /*!< 0x00000100U */
#define XSPIM_PCR_NCSEN                  XSPIM_PCR_NCSEN_Msk                              /*!< nCS Enable for Port n*/
#define XSPIM_PCR_NCSSRC_Pos             (9U)
#define XSPIM_PCR_NCSSRC_Msk             (0x1UL << XSPIM_PCR_NCSSRC_Pos)                  /*!< 0x00000200U */
#define XSPIM_PCR_NCSSRC                 XSPIM_PCR_NCSSRC_Msk                             /*!< nCS Source for Port n */
#define XSPIM_PCR_IOLEN_Pos              (16U)
#define XSPIM_PCR_IOLEN_Msk              (0x1UL << XSPIM_PCR_IOLEN_Pos)                   /*!< 0x00010000U */
#define XSPIM_PCR_IOLEN                  XSPIM_PCR_IOLEN_Msk                              /*!< IO[3:0] Enable for Port n */
#define XSPIM_PCR_IOLSRC_Pos             (17U)
#define XSPIM_PCR_IOLSRC_Msk             (0x3UL << XSPIM_PCR_IOLSRC_Pos)                  /*!< 0x00060000U */
#define XSPIM_PCR_IOLSRC                 XSPIM_PCR_IOLSRC_Msk                             /*!< IO[3:0] Source for Port n */
#define XSPIM_PCR_IOLSRC_0               (0x1UL << XSPIM_PCR_IOLSRC_Pos)                  /*!< 0x00020000 */
#define XSPIM_PCR_IOLSRC_1               (0x2UL << XSPIM_PCR_IOLSRC_Pos)                  /*!< 0x00040000 */
#define XSPIM_PCR_IOHEN_Pos              (24U)
#define XSPIM_PCR_IOHEN_Msk              (0x1UL << XSPIM_PCR_IOHEN_Pos)                   /*!< 0x01000000U */
#define XSPIM_PCR_IOHEN                  XSPIM_PCR_IOHEN_Msk                              /*!< IO[7:4] Enable for Port n */
#define XSPIM_PCR_IOHSRC_Pos             (25U)
#define XSPIM_PCR_IOHSRC_Msk             (0x3UL << XSPIM_PCR_IOHSRC_Pos)                  /*!< 0x06000000U */
#define XSPIM_PCR_IOHSRC                 XSPIM_PCR_IOHSRC_Msk                             /*!< IO[7:4] Source for Port n */
#define XSPIM_PCR_IOHSRC_0               (0x1UL << XSPIM_PCR_IOHSRC_Pos)                  /*!< 0x02000000U */
#define XSPIM_PCR_IOHSRC_1               (0x2UL << XSPIM_PCR_IOHSRC_Pos)                  /*!< 0x04000000U */

/******************************************************************************/
/*                                                                            */
/*                                  OCTOSPIM                                  */
/*                                                                            */
/******************************************************************************/
/***************  Bit definition for OCTOSPIM_CR register  ********************/
#define OCTOSPIM_CR_MUXEN_Pos               XSPIM_CR_MUXEN_Pos
#define OCTOSPIM_CR_MUXEN_Msk               XSPIM_CR_MUXEN_Msk                            /*!< 0x00000001 */
#define OCTOSPIM_CR_MUXEN                   XSPIM_CR_MUXEN                                /*!< Multiplexed Mode Enable */
#define OCTOSPIM_CR_REQ2ACK_TIME_Pos        XSPIM_CR_REQ2ACK_TIME_Pos
#define OCTOSPIM_CR_REQ2ACK_TIME_Msk        XSPIM_CR_REQ2ACK_TIME_Msk                     /*!< 0x00FF0000 */
#define OCTOSPIM_CR_REQ2ACK_TIME            XSPIM_CR_REQ2ACK_TIME                         /*!< REQ to ACK Time */

/***************  Bit definition for OCTOSPIM_PCR register  *****************/
#define OCTOSPIM_PCR_CLKEN_Pos              XSPIM_PCR_CLKEN_Pos
#define OCTOSPIM_PCR_CLKEN_Msk              XSPIM_PCR_CLKEN_Msk                           /*!< 0x00000001 */
#define OCTOSPIM_PCR_CLKEN                  XSPIM_PCR_CLKEN                               /*!< CLK/CLKn Enable for Port n */
#define OCTOSPIM_PCR_CLKSRC_Pos             XSPIM_PCR_CLKSRC_Pos
#define OCTOSPIM_PCR_CLKSRC_Msk             XSPIM_PCR_CLKSRC_Msk                          /*!< 0x00000002 */
#define OCTOSPIM_PCR_CLKSRC                 XSPIM_PCR_CLKSRC                              /*!< CLK/CLKn Source for Port n*/
#define OCTOSPIM_PCR_DQSEN_Pos              XSPIM_PCR_DQSEN_Pos
#define OCTOSPIM_PCR_DQSEN_Msk              XSPIM_PCR_DQSEN_Msk                           /*!< 0x00000010 */
#define OCTOSPIM_PCR_DQSEN                  XSPIM_PCR_DQSEN                               /*!< DQS Enable for Port n */
#define OCTOSPIM_PCR_DQSSRC_Pos             XSPIM_PCR_DQSSRC_Pos
#define OCTOSPIM_PCR_DQSSRC_Msk             XSPIM_PCR_DQSSRC_Msk                          /*!< 0x00000020 */
#define OCTOSPIM_PCR_DQSSRC                 XSPIM_PCR_DQSSRC                              /*!< DQS Source for Port n */
#define OCTOSPIM_PCR_NCSEN_Pos              XSPIM_PCR_NCSEN_Pos
#define OCTOSPIM_PCR_NCSEN_Msk              XSPIM_PCR_NCSEN_Msk                           /*!< 0x00000100U */
#define OCTOSPIM_PCR_NCSEN                  XSPIM_PCR_NCSEN                               /*!< nCS Enable for Port n*/
#define OCTOSPIM_PCR_NCSSRC_Pos             XSPIM_PCR_NCSSRC_Pos
#define OCTOSPIM_PCR_NCSSRC_Msk             XSPIM_PCR_NCSSRC_Msk                          /*!< 0x00000200U */
#define OCTOSPIM_PCR_NCSSRC                 XSPIM_PCR_NCSSRC                              /*!< nCS Source for Port n */
#define OCTOSPIM_PCR_IOLEN_Pos              XSPIM_PCR_IOLEN_Pos
#define OCTOSPIM_PCR_IOLEN_Msk              XSPIM_PCR_IOLEN_Msk                           /*!< 0x00010000U */
#define OCTOSPIM_PCR_IOLEN                  XSPIM_PCR_IOLEN                               /*!< IO[3:0] Enable for Port n */
#define OCTOSPIM_PCR_IOLSRC_Pos             XSPIM_PCR_IOLSRC_Pos
#define OCTOSPIM_PCR_IOLSRC_Msk             XSPIM_PCR_IOLSRC_Msk                          /*!< 0x00060000U */
#define OCTOSPIM_PCR_IOLSRC                 XSPIM_PCR_IOLSRC                              /*!< IO[3:0] Source for Port n */
#define OCTOSPIM_PCR_IOLSRC_0               XSPIM_PCR_IOLSRC_0                            /*!< 0x00020000 */
#define OCTOSPIM_PCR_IOLSRC_1               XSPIM_PCR_IOLSRC_1                            /*!< 0x00040000 */
#define OCTOSPIM_PCR_IOHEN_Pos              XSPIM_PCR_IOHEN_Pos
#define OCTOSPIM_PCR_IOHEN_Msk              XSPIM_PCR_IOHEN_Msk                           /*!< 0x01000000U */
#define OCTOSPIM_PCR_IOHEN                  XSPIM_PCR_IOHEN                               /*!< IO[7:4] Enable for Port n */
#define OCTOSPIM_PCR_IOHSRC_Pos             XSPIM_PCR_IOHSRC_Pos
#define OCTOSPIM_PCR_IOHSRC_Msk             XSPIM_PCR_IOHSRC_Msk                          /*!< 0x06000000U */
#define OCTOSPIM_PCR_IOHSRC                 XSPIM_PCR_IOHSRC                              /*!< IO[7:4] Source for Port n */
#define OCTOSPIM_PCR_IOHSRC_0               XSPIM_PCR_IOHSRC_0                            /*!< 0x02000000U */
#define OCTOSPIM_PCR_IOHSRC_1               XSPIM_PCR_IOHSRC_1                            /*!< 0x04000000U */

/******************************************************************************/
/*                                                                            */
/*                        Delay Block Interface (DLYB)                        */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DLYB_CR register  ********************/
#define DLYB_CR_DEN_Pos                     (0U)
#define DLYB_CR_DEN_Msk                     (0x1UL << DLYB_CR_DEN_Pos)              /*!< 0x00000001 */
#define DLYB_CR_DEN                         DLYB_CR_DEN_Msk                         /*!<Delay Block enable */
#define DLYB_CR_SEN_Pos                     (1U)
#define DLYB_CR_SEN_Msk                     (0x1UL << DLYB_CR_SEN_Pos)              /*!< 0x00000002 */
#define DLYB_CR_SEN                         DLYB_CR_SEN_Msk                         /*!<Sampler length enable */

/*******************  Bit definition for DLYB_CFGR register  ********************/
#define DLYB_CFGR_SEL_Pos                   (0U)
#define DLYB_CFGR_SEL_Msk                   (0xFUL << DLYB_CFGR_SEL_Pos)            /*!< 0x0000000F */
#define DLYB_CFGR_SEL                       DLYB_CFGR_SEL_Msk                       /*!<Select the phase for the Output clock[3:0] */
#define DLYB_CFGR_SEL_0                     (0x1UL << DLYB_CFGR_SEL_Pos)            /*!< 0x00000001 */
#define DLYB_CFGR_SEL_1                     (0x2UL << DLYB_CFGR_SEL_Pos)            /*!< 0x00000002 */
#define DLYB_CFGR_SEL_2                     (0x3UL << DLYB_CFGR_SEL_Pos)            /*!< 0x00000003 */
#define DLYB_CFGR_SEL_3                     (0x8UL << DLYB_CFGR_SEL_Pos)            /*!< 0x00000008 */

#define DLYB_CFGR_UNIT_Pos                  (8U)
#define DLYB_CFGR_UNIT_Msk                  (0x7FUL << DLYB_CFGR_UNIT_Pos)          /*!< 0x00007F00 */
#define DLYB_CFGR_UNIT                      DLYB_CFGR_UNIT_Msk                      /*!<Delay Defines the delay of a Unit delay cell[6:0] */
#define DLYB_CFGR_UNIT_0                    (0x01UL << DLYB_CFGR_UNIT_Pos)          /*!< 0x00000100 */
#define DLYB_CFGR_UNIT_1                    (0x02UL << DLYB_CFGR_UNIT_Pos)          /*!< 0x00000200 */
#define DLYB_CFGR_UNIT_2                    (0x04UL << DLYB_CFGR_UNIT_Pos)          /*!< 0x00000400 */
#define DLYB_CFGR_UNIT_3                    (0x08UL << DLYB_CFGR_UNIT_Pos)          /*!< 0x00000800 */
#define DLYB_CFGR_UNIT_4                    (0x10UL << DLYB_CFGR_UNIT_Pos)          /*!< 0x00001000 */
#define DLYB_CFGR_UNIT_5                    (0x20UL << DLYB_CFGR_UNIT_Pos)          /*!< 0x00002000 */
#define DLYB_CFGR_UNIT_6                    (0x40UL << DLYB_CFGR_UNIT_Pos)          /*!< 0x00004000 */

